In [1]:
import torch
import pandas as pd
import numpy as np

In [25]:
train_csv = pd.read_csv('./datasets/train.csv')
train_csv.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True

In [13]:
train_data = train_csv[['PassengerId', 'Age']]

In [14]:
train_data.head()

  PassengerId   Age
0     0001_01  39.0
1     0002_01  24.0
2     0003_01  58.0
3     0003_02  33.0
4     0004_01  16.0

In [18]:
Id_df = train_data['PassengerId'].str.split('_', expand=True)

In [19]:
Id_df.head()

      0   1
0  0001  01
1  0002  01
2  0003  01
3  0003  02
4  0004  01

In [21]:
Id_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       8693 non-null   object
 1   1       8693 non-null   object
dtypes: object(2)
memory usage: 136.0+ KB

In [23]:
Id_df = Id_df.drop(columns=1, axis=1)

In [24]:
Id_df.head()

      0
0  0001
1  0002
2  0003
3  0003
4  0004

In [29]:
train_data.loc['PassengerId'] = Id_df[0]

/home/heine/Tools/anaconda3/envs/deep_learning/lib/python3.9/site-packages/pandas/core/indexing.py:1700: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, v, pi)

In [30]:
train_data.head()

  PassengerId   Age
0        0001  39.0
1        0002  24.0
2        0003  58.0
3        0003  33.0
4        0004  16.0